<?php

namespace Database\Seeders;

use App\Models\PriceOffer;
use Illuminate\Database\Seeder;

class PriceOfferSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $priceOffers = [
            [
                'title' => 'устная консультация (правовой совет) не требующая проведения правового анализа документов и судебной практики',
                'price' => 3000,
            ],
            [
                'title' => 'устная консультация с предварительным анализом пакета документов и судебной практики',
                'price' => 8000,
            ],
            [
                'title' => 'письменная консультация, составление заявлений, жалоб, обращений, ходатайств в органы государственной и муниципальной власти, должностным лицам и в иные организации',
                'price' => 10000,
            ],
            [
                'title' => 'составление проектов уставов, положений, договоров, соглашений и иных сложных юридических документов',
                'price' => 10000,
            ],
            [
                'title' => 'истребование и собирание доказательств по делу, направление запросов, в том числе адвокатских, опрос лиц с их согласия с составлением протокола, за день занятости',
                'price' => 8000,
            ],
            [
                'title' => 'составление искового заявления, административного искового заявления, иного заявления, которым инициируется дело в суде общей юрисдикции',
                'price' => 10000,
            ],
            [
                'title' => 'составление искового заявления, иного заявления, которыми инициируется дело в арбитражных судах, в том числе, по обособленному спору в рамках дела о несостоятельности (банкротстве), а также составление отзыва на такие заявления',
                'price' => 10000,
            ],
            [
                'title' => 'составление иных процессуальных документов, в том числе ходатайств, заявлений, объяснений, правовых обоснований и т.п. по делам, рассматриваемым судами общей юрисдикции (за один документ)',
                'price' => 10000,
            ],
            [
                'title' => 'участие в судебных заседаниях судов первой инстанции по гражданским, административным делам и делам об административных правонарушениях, рассматриваемых судами общей юрисдикции, за один день занятости',
                'price' => 10000,
            ],
            [
                'title' => 'участие в судебных заседаниях арбитражных судов первой инстанции, за исключением дел о банкротстве, за один день занятости',
                'price' => 10000,
            ],
            [
                'title' => 'составление процессуальных документов (за исключением исковых заявлений) по делам, рассматриваемым арбитражными судами (за один документ)',
                'price' => 10000,
            ],
            [
                'title' => 'составление апелляционной, кассационной, надзорной жалобы, а также отзыва/возражения на такие жалобы адвокатом, участвовавшим в судебных заседаниях суда первой инстанции, по гражданским, административным делам и делам об административных правонарушениях в судах общей юрисдикции',
                'price' => 10000,
            ],
            [
                'title' => 'составление апелляционной, кассационной, надзорной жалобы, а также отзыва/возражения на такие жалобы адвокатом, не принимавшим участия в судебных заседаниях суда первой инстанции, по гражданским, административным делам и делам об административных правонарушениях в судах общей юрисдикции',
                'price' => 20000,
            ],
            [
                'title' => 'составление апелляционной, кассационной, надзорной жалобы, а также отзыва/возражения на такие жалобы адвокатом, участвовавшим в судебных заседаниях суда первой инстанции, по делам, рассматриваемым в арбитражных судах',
                'price' => 15000,
            ],
            [
                'title' => 'составление апелляционной, кассационной, надзорной жалобы, а также отзыва/возражения на такие жалобы адвокатом, не принимавшим участия в судебных заседаниях суда первой инстанции, по делам, рассматриваемым в арбитражных судах',
                'price' => 25000,
            ],
            [
                'title' => 'участие в судебных заседаниях апелляционных и кассационных инстанций судов общей юрисдикции, за день занятости',
                'price' => 10000,
            ],
            [
                'title' => 'участие в судебных заседаниях апелляционных и кассационных инстанций судов арбитражных судов, за день занятости',
                'price' => 20000,
            ],
            [
                'title' => 'ведение дел, рассматриваемых арбитражными судами в порядке упрощенного производства',
                'price' => 20000,
            ],
            [
                'title' => 'участие в исполнительном производстве (за исключением обжалования действий/бездействий в суде)',
                'price' => 30000,
            ],
            [
                'title' => 'при оплате за участие в отдельных действиях в рамках исполнительного производства за день занятости',
                'price' => 10000,
            ],
            [
                'title' => 'представительство сторон в корпоративных спорах',
                'price' => 40000,
            ],
            [
                'title' => 'представительство сторон в третейских судах, в процедуре медиации',
                'price' => 15000,
            ],
        ];

        foreach ($priceOffers as $offer) {
            $offer['title'] = mb_strtoupper(mb_substr($offer['title'], 0, 1, 'UTF-8'), 'UTF-8').mb_substr($offer['title'], 1, null, 'UTF-8');
            PriceOffer::create($offer);
        }
    }
}
